---
kind: property
id: P:Autodesk.Revit.DB.Visual.SchemaCommon.Keyword
source: html/f7b9c410-0d7f-14ed-2fca-510e42af8af7.htm
---
# Autodesk.Revit.DB.Visual.SchemaCommon.Keyword Property

The property labeled "Keyword" common to all visual Asset types.

## Syntax (C#)
```csharp
public static string Keyword { get; }
```

## Remarks
This property is of type "AssetPropertyString".
 Use ":" to add several keywords.